app/controllers/patients_controller.rb

INSERT INTO "patients" ("name", "condition", "nurse_id", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "brianosora."], ["condition", "fever"], ["nurse_id", 1], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-28 12:18:43.066806"], ["updated_at", "2023-03-28 12:18:43.066806"]]
---
    def create
        patient = Patient.create!(patient_params)