app/controllers/sessions_controller.rb

SELECT "patients".* FROM "patients" WHERE "patients"."name" = ? LIMIT ?  [["name", "osora"], ["LIMIT", 1]]
---
    def create
        patient = Patient.find_by(name: params[:name])